import { Translations } from './config';

export const bg: Translations = {
  language: {
    flag: "🇧🇬",
    name: "Български",
  },
  errors: {
    needMoreParticipants: "Нужни са поне 2 участника!",
    invalidPairs: "Не може да се генерират валидни двойки с текущите правила. Моля, проверете правилата и опитайте отново.",
    multipleMustRules: "Намерени са множество задължителни правила",
    conflictingRules: "Конфликт между задължително правило и правило за изключване",
    emptyName: "Празно име",
    duplicateName: "Дублирано име: {{name}}",
    invalidRuleFormat: "Невалиден формат на правило: {{rule}}",
    unknownParticipant: "Неизвестен участник в правилото: {{name}}",
    noValidReceivers: "Няма валидни получатели за този участник",
    line: "Ред {{number}}"
  },
  home: {
    vanity: "Проектът е започнат през зимата на 2015 г. от Maël",
    sponsor: "Подкрепете ме в GitHub",
    title: "Свитъка на тайния Дадо Коледа",
    explanation: [
      "Добре дошли! Този инструмент ще ви помогне да организирате обмяната на подаръци. Просто избройте всички участници и ние ще назначим случайни двойки според правилата, които сте задали.",
      "Ще получите уникална връзка за всеки участник, която ще трябва да споделите сами (чрез имейл, Slack и т.н.). [<exampleLink>Примерна връзка</exampleLink>]",
    ].map(line => `<p>${line}</p>`).join(''),
    exampleLink: "Примерна връзка",
  },
  pairing: {
    title: "Вашето тайнo подаръчно задание",
    assignment: "Добре дошли, <name/>! Избрани сте да направите подарък за:",
    loading: "Зареждане...",
    error: "Неуспешно декриптиране на съобщението. Връзката може да е невалидна.",
    linkAlreadyOpened: "Вече сте отворили връзка за Тайна Подарък. От съображения за сигурност можете да видите само едно задание на браузър.",
    startYourOwn: "Започнете тайно подарък!"
  },
  participants: {
    title: "Участници",
    generationWarning: "Важно: Всяка промяна в списъка с участници или настройките ще изисква създаване на нови двойки. Съществуващите връзки няма да бъдат ретроактивно модифицирани.",
    addPerson: "Добави Човек",
    generatePairs: "Генерирай Двойки",
    enterName: "Въведете име на участник",
    editRules: "Редактирай правила",
    removeParticipant: "Премахни участник",
    rulesCount_one: "{{count}} правило зададено",
    rulesCount_other: "{{count}} правила зададени",
    switchToFormView: "Превключи към изглед на формуляр",
    switchToTextView: "Превключи към текстов изглед"
  },
  rules: {
    title: "Правила за {{name}}",
    mustBePairedWith: "Трябва да бъде сдвоен с",
    mustNotBePairedWith: "Не трябва да бъде сдвоен с",
    selectParticipant: "Изберете друг участник",
    removeRule: "Премахни правило",
    addMustRule: "Принуди Сдвояване",
    addMustNotRule: "Предотврати Сдвояване",
    cancel: "Отказ",
    saveRules: "Запази Правила",
    hintLabel: 'Подсказка за Подарък',
    hintPlaceholder: 'Въведете подсказка за предпочитания за подарък (по избор)',
  },
  links: {
    title: "Връзки за Споделяне",
    warningParticipantsChanged: "Внимание: Участниците или правилата са променени от последното генериране на тези връзки.",
    resetAssignments: "Регенерирай Двойки",
    shareInstructions: "Споделете тези връзки само с съответния дарител",
    exportCSV: "Експортирай като CSV",
    printPostCards: "Принтирай Пощенски Картички",
    copySecretLink: "Копирай Тайна Връзка",
    linkCopied: "Добавено в клипборда!",
    for: "за"
  },
  settings: {
    title: "Настройки",
    instructions: "Допълнителни Инструкции",
    instructionsPlaceholder: "напр., бюджет, дата, местоположение...",
    instructionsHelp: "Те ще бъдат показани на всички участници на страницата им със задание. Бъдете кратки: това увеличава дължината на връзките."
  }
};


